
const postList = [
    {
        "no": 22,
        "title": "★2023 동계 프로그래밍 캠프 모집 안내",
        "type": "공지사항",
        "content": 
        `
        ★<2023 컴퓨터공학부 동계 프로그래밍 캠프 재개 및 모집 안내>
        안녕하세요, 컴퓨터공학부 사무실입니다.
        2023 동계 프로그래밍 캠프가 재개되어 안내드립니다.

        컴퓨터공학부에서는 프로그래밍 몰입교육의 일환으로 방학 중 프로그래밍 캠프를 재개하고자 합니다.
        모든 경비는 학부에서 지원하며 교수님들의 지도하에 3박 4일 동안 집중적으로 프로그래밍 공부를 할 수 있는 좋은 기회이므로, 많은 신청 바랍니다.
        자세한 내용은 아래를 참고해주시기 바랍니다.
        많은 참여 부탁드립니다.

        -----------------------------------------------------------------------------

        1. 일시 : 2024년 1월 15일 (월) ~ 2024년 1월 18일 (목) , 3박 4일간

        2. 장소 : 경기도 양평군 강하면 블룸비스타 (https://www.bloomvista.co.kr/) 예정

        3. 모집인원 및 선발 : 100명
        (신청자가 모두 참가 확정이 아니며, 추후 면담과 서약서까지 제출해야 확정됨)
        (예상 모집 인원 : 1학년 60%, 2학년 30%, 3학년 이상 10%) 내외
        (신청 인원 초과시 내부 기준에 의해 선발합니다.)

        4. 모집대상 : 1학년 (컴퓨터공학부 소속 트랙을 신청한 학생) ~ 3학년, 편입생, 복학생(2024년 1학기)

        5. 반 편성 : 1단계 ~ 4단계 수준별 반 편성

        -> 레벨 1 : C 프로그래밍 초급 -> 프로그래밍 반복 연습으로 실력 향상
        -> 레벨 2 : C 프로그래밍을 어느 정도 하는 수준 -> C 응용 프로그래밍 연습
        -> 레벨 3 : C++/Java 프로그래밍을 어느 정도 하는 수준 --> C++/Java 응용 프로그래밍 연습
        -> 레벨 4 : 미니 프로젝트를 하고 싶은 수준 -> 작은 프로젝트를 여러 개 수행

        6. 교육 내용 : C, C++, Java 문제 풀이식 프로그래밍 및 프로젝트 집중

        7. 참가신청 : ~11/15일 (수요일 오후 3시) 까지 (모집인원의 130% 초과시 조기 마감될 수 있음)

        8. 참가방법: 아래의 신청 링크를 통해 신청
        https://docs.google.com/forms/d/e/1FAIpQLSfefXT1GbjysJbFBUiqMVsJ8mqYUVCZZ7bSO-jAOfVTQbEP9w/viewform?usp=sharing

        9. 참가비 : 무료
        10. 기타 : 신청자가 모집인원을 초과할 경우, 내부 기준에 따라 선발함. 수료증 수여,캠프 브이로그 제작에 지원할 학생은 설문조사 폼 내 프로그래밍 캠프에 바라는 점 문항에 ‘브이로그 제작지원 희망’ 문구 기입할 것 (제작비 지원)
        연락처 정보 및 개인정보 잘못 기입 되었을 경우 연락이 되지 않아 신청이 취소될 수 있습니다.

        11월 20일 (월요일) 오후 3시 OT 및 서약서 제출을 반드시 해야 합니다. (수업 참여 등 부득이한 사정으로 OT 미참석 시 서약서 서면제출 가능)

        11. 일정 (예정)

        오전 오후 저녁
        1/15 월요일 출발 프로그래밍 연습 자유시간
        1/16 화요일 프로그래밍 연습 프로그래밍 연습 자유시간
        1/17 수요일 프로그래밍 연습 프로그래밍 연습 자유시간
        1/18 목요일 캠프 결산 미팅 도착

        12. 문의 : 한기준 교수님(연구관 215호, keejun.han@hansung.ac.kr) 에게 문의

        ※주의사항 : 신청 후 적절하지 않은 사유로 참가하지 않는 학생은, 타학생의 참가 기회를 박탈하게 되는 것이므로 이후 동계캠프에 참여할 수 없습니다.※
        `
        ,
        "createDate": "2023-11-08",
        "person": "행정조교",
        "readCount": 1004
    },
    {
        "no": 21,
        "title": "스물한 번째 게시글입니다.",
        "type": "공지사항",
        "content": "스물한 번째 게시글 내용입니다.",
        "createDate": "2023-09-21",
        "person": "행정조교",
        "readCount": 129
    },
    {
        "no": 20,
        "title": "스무번 째 게시글입니다.",
        "type": "공지사항",
        "content": "스무번 째 게시글 내용입니다.",
        "createDate": "2023-08-20",
        "person": "행정조교",
        "readCount": 208
    },
    {
        "no": 19,
        "title": "열아홉 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열아홉 번째 게시글 내용입니다.",
        "createDate": "2023-07-19",
        "person": "행정조교",
        "readCount": 719
    },
    {
        "no": 18,
        "title": "열여덟 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열여덟 번째 게시글 내용입니다.",
        "createDate": "2023-06-18",
        "person": "행정조교",
        "readCount": 168
    },
    {
        "no": 17,
        "title": "열일곱 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열일곱 번째 게시글 내용입니다.",
        "createDate": "2023-05-17",
        "person": "행정조교",
        "readCount": 517
    },
    {
        "no": 16,
        "title": "열여섯 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열여섯 번째 게시글 내용입니다.",
        "createDate": "2023-04-16",
        "person": "행정조교",
        "readCount": 416
    },
    {
        "no": 15,
        "title": "열다섯 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열다섯 번째 게시글 내용입니다.",
        "createDate": "2023-03-15",
        "person": "행정조교",
        "readCount": 315
    },
    {
        "no": 14,
        "title": "열네 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열네 번째 게시글 내용입니다.",
        "createDate": "2023-02-14",
        "person": "행정조교",
        "readCount": 214
    },
    {
        "no": 13,
        "title": "열세 번째 게시글입니다.",
        "type": "공지사항",
        "content": 
        `
        안녕하세요~
        컴퓨터공학부 행정조교입니다.
        지도교수 변경을 희망하는 학생들은 ~9/14 목요일 09시까지 아래 링크를 통해 제출하시기 바랍니다.
        제출된 내용은 10월 마지막주부터 스마트 자기관리 시스템에서 확인 가능합니다.
        `,
        "createDate": "2023-01-13",
        "person": "행정조교",
        "readCount": 113
    },
    {
        "no": 12,
        "title": "★★★★★★★★★★★★★★★★★",
        "type": "공지사항",
        "content": "열두 번째 게시글 내용입니다.",
        "createDate": "2021-12-12",
        "person": "행정조교",
        "readCount": 121
    },
    {
        "no": 11,
        "title": "열한 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열한 번째 게시글 내용입니다.",
        "createDate": "2021-11-11",
        "person": "행정조교",
        "readCount": 1111
    },
    {
        "no": 10,
        "title": "열 번째 게시글입니다.",
        "type": "공지사항",
        "content": "열 번째 게시글 내용입니다.",
        "createDate": "2020-10-10",
        "person": "행정조교",
        "readCount": 10
    },
    {
        "no": 9,
        "title": "아홉 번째 게시글입니다.",
        "type": "공지사항",
        "content": "아홉 번째 게시글 내용입니다.",
        "createDate": "2019-09-09",
        "person": "행정조교",
        "readCount": 999
    },
    {
        "no": 8,
        "title": "여덟 번째 게시글입니다.",
        "type": "공지사항",
        "content": "여덟 번째 게시글 내용입니다.",
        "createDate": "2019-08-08",
        "person": "행정조교",
        "readCount": 88
    },
    {
        "no": 7,
        "title": "일곱 번째 게시글입니다.",
        "type": "공지사항",
        "content": "일곱 번째 게시글 내용입니다.",
        "createDate": "2019-07-07",
        "person": "행정조교",
        "readCount": 777
    },
    {
        "no": 6,
        "title": "여섯 번째 게시글입니다.",
        "type": "공지사항",
        "content": "여섯 번째 게시글 내용입니다.",
        "createDate": "2018-06-06",
        "person": "행정조교",
        "readCount": 66
    },
    {
        "no": 5,
        "title": "다섯 번째 게시글입니다.",
        "type": "공지사항",
        "content": "다섯 번째 게시글 내용입니다.",
        "createDate": "2018-05-05",
        "person": "행정조교",
        "readCount": 55
    },
    {
        "no": 4,
        "title": "네 번째 게시글입니다.",
        "type": "공지사항",
        "content": "네 번째 게시글 내용입니다.",
        "createDate": "2018-04-04",
        "person": "행정조교",
        "readCount": 444
    },
    {
        "no": 3,
        "title": "세 번째 게시글입니다.",
        "type": "공지사항",
        "content": "세 번째 게시글 내용입니다.",
        "createDate": "2017-03-03",
        "person": "행정조교",
        "readCount": 333
    },
    {
        "no": 2,
        "title": "두 번째 게시글입니다.",
        "type": "공지사항",
        "content": "두 번째 게시글 내용입니다.",
        "createDate": "2017-02-02",
        "person": "행정조교",
        "readCount": 222
    },
    {
        "no": 1,
        "title": "첫 번째 게시글입니다.",
        "type": "공지사항",
        "content": "첫 번째 게시글 내용입니다.",
        "createDate": "2017-01-01",
        "person": "행정조교",
        "readCount": 111
    },
];

const getPostByNo = no => {
    const array = postList.filter(x => x.no === parseInt(no));
    if (array.length === 1) {
        return array[0];
    }
    return null;
}

export {
    postList,
    getPostByNo
};